In [7]:
import pandas as pd

In [8]:
df = pd.read_csv('C:/Users/Ramsha Ahmed/Documents/students.csv')

In [9]:
df.head()

   StudentID     Name    Course  Marks  Age           City
0        101    Alice    Python     85   20       New York
1        102      Bob    Python     67   21        Chicago
2        103  Charlie       SQL     74   22  San Francisco
3        104    Diana  Power BI     92   23       New York
4        105    Ethan    Python     58   20        Chicago

In [10]:
df.tail(2)

   StudentID   Name  Course  Marks  Age           City
4        105  Ethan  Python     58   20        Chicago
5        106  Fiona     SQL     81   21  San Francisco

In [11]:
df.shape

(6, 6)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   StudentID  6 non-null      int64
 1   Name       6 non-null      object
 2   Course     6 non-null      object
 3   Marks      6 non-null      int64
 4   Age        6 non-null      int64
 5   City       6 non-null      object
dtypes: int64(3), object(3)
memory usage: 420.0+ bytes

In [13]:
df.describe()

        StudentID      Marks        Age
count    6.000000   6.000000   6.000000
mean   103.500000  76.166667  21.166667
std      1.870829  12.416387   1.169045
min    101.000000  58.000000  20.000000
25%    102.250000  68.750000  20.250000
50%    103.500000  77.500000  21.000000
75%    104.750000  84.000000  21.750000
max    106.000000  92.000000  23.000000

In [14]:
df.columns

Index(['StudentID', 'Name', 'Course', 'Marks', 'Age', 'City'], dtype='object')

In [15]:
df.sample(3)

   StudentID   Name  Course  Marks  Age           City
5        106  Fiona     SQL     81   21  San Francisco
0        101  Alice  Python     85   20       New York
4        105  Ethan  Python     58   20        Chicago

In [16]:
df.dtypes

StudentID     int64
Name         object
Course       object
Marks         int64
Age           int64
City         object
dtype: object

In [17]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [18]:
print(df.sort_values(by='Age', ascending = False))

   StudentID     Name    Course  Marks  Age           City
3        104    Diana  Power BI     92   23       New York
2        103  Charlie       SQL     74   22  San Francisco
5        106    Fiona       SQL     81   21  San Francisco
1        102      Bob    Python     67   21        Chicago
0        101    Alice    Python     85   20       New York
4        105    Ethan    Python     58   20        Chicago

In [19]:
print(df.sort_values(by='Marks', ascending = True))

   StudentID     Name    Course  Marks  Age           City
4        105    Ethan    Python     58   20        Chicago
1        102      Bob    Python     67   21        Chicago
2        103  Charlie       SQL     74   22  San Francisco
5        106    Fiona       SQL     81   21  San Francisco
0        101    Alice    Python     85   20       New York
3        104    Diana  Power BI     92   23       New York

In [20]:
df['City']

0         New York
1          Chicago
2    San Francisco
3         New York
4          Chicago
5    San Francisco
Name: City, dtype: object

In [21]:
print(df['City'].value_counts())

City
New York         2
Chicago          2
San Francisco    2
Name: count, dtype: int64

In [22]:
df.loc[4,'Name']

'Ethan'

In [23]:
df.iloc[2,2]

'SQL'

In [26]:
print(df[(df['Marks'] > 85) & (df['Course'] != 'SQL')])

   StudentID   Name    Course  Marks  Age      City
3        104  Diana  Power BI     92   23  New York

In [25]:
high_scores = df[df['Marks'] >= 80]
print(high_scores)

   StudentID   Name    Course  Marks  Age           City
0        101  Alice    Python     85   20       New York
3        104  Diana  Power BI     92   23       New York
5        106  Fiona       SQL     81   21  San Francisco

In [31]:
print(df[df['Marks'] < 90]['Name'])

0      Alice
1        Bob
2    Charlie
4      Ethan
5      Fiona
Name: Name, dtype: object